a = '''1 	008 	ALL 	Лек 	Албания 	
2 	012 	DZD 	Алжирский динар 	Алжир 	
3 	032 	ARS 	Аргентинское песо 	Аргентина 	
4 	036 	AUD 	Австралийский доллар 	Австралия; Кирибати; Кокосовые (Килинг) острова; Науру; Остров Норфолк; Остров Рождества; Остров Херд и острова Макдональд; Тувалу 	
5 	044 	BSD 	Багамский доллар 	Багамы 	
6 	048 	BHD 	Бахрейнский динар 	Бахрейн 	
7 	050 	BDT 	Така 	Бангладеш 	
8 	051 	AMD 	Армянский драм 	Армения 	
9 	052 	BBD 	Барбадосский доллар 	Барбадос 	
10 	060 	BMD 	Бермудский доллар 	Бермуды 	
11 	064 	BTN 	Нгултрум 	Бутан 	
12 	068 	BOB 	Боливиано 	Боливия, многонациональное государство 	
13 	072 	BWP 	Пула 	Ботсвана 	
14 	084 	BZD 	Белизский доллар 	Белиз 	
15 	090 	SBD 	Доллар Соломоновых Островов 	Соломоновы Острова 	
16 	096 	BND 	Брунейский доллар 	Бруней-Даруссалам 	
17 	104 	MMK 	Кьят 	Мьянма 	
18 	108 	BIF 	Бурундийский франк 	Бурунди 	
19 	116 	KHR 	Риель 	Камбоджа 	
20 	124 	CAD 	Канадский доллар 	Канада 	
21 	132 	CVE 	Эскудо Кабо-Верде 	Кабо-Верде 	
22 	136 	KYD 	Доллар Островов Кайман 	Острова Кайман 	
23 	144 	LKR 	Шри-ланкийская рупия 	Шри-Ланка 	
24 	152 	CLP 	Чилийское песо 	Чили 	
25 	156 	CNY 	Юань 	Китай 	
26 	170 	COP 	Колумбийское песо 	Колумбия 	
27 	174 	KMF 	Коморский франк 	Коморы 	
28 	188 	CRC 	Коста-риканский колон 	Коста-Рика 	
29 	191 	HRK 	Куна 	Хорватия 	
30 	192 	CUP 	Кубинское песо 	Куба 	
31 	203 	CZK 	Чешская крона 	Чехия 	
32 	208 	DKK 	Датская крона 	Гренландия; Дания; Фарерские острова 	
33 	214 	DOP 	Доминиканское песо 	Доминиканская Республика 	
34 	222 	SVC 	Сальвадорский колон 	Эль-Сальвадор 	
35 	230 	ETB 	Эфиопский быр 	Эфиопия 	
36 	232 	ERN 	Накфа 	Эритрея 	
37 	238 	FKP 	Фунт Фолклендских островов 	Фолклендские острова (Мальвинские) 	
38 	242 	FJD 	Доллар Фиджи 	Фиджи 	
39 	262 	DJF 	Франк Джибути 	Джибути 	
40 	270 	GMD 	Даласи 	Гамбия 	
41 	292 	GIP 	Гибралтарский фунт 	Гибралтар 	
42 	320 	GTQ 	Кетсаль 	Гватемала 	
43 	324 	GNF 	Гвинейский франк 	Гвинея 	
44 	328 	GYD 	Гайанский доллар 	Гайана 	
45 	332 	HTG 	Гурд 	Гаити 	
46 	340 	HNL 	Лемпира 	Гондурас 	
47 	344 	HKD 	Гонконгский доллар 	Гонконг 	
48 	348 	HUF 	Форинт 	Венгрия 	
49 	352 	ISK 	Исландская крона 	Исландия 	
50 	356 	INR 	Индийская рупия 	Бутан; Индия 	
51 	360 	IDR 	Рупия 	Индонезия 	
52 	364 	IRR 	Иранский риал 	Иран (Исламская Республика) 	
53 	368 	IQD 	Иракский динар 	Ирак 	
54 	376 	ILS 	Новый израильский шекель 	Израиль 	
55 	388 	JMD 	Ямайский доллар 	Ямайка 	
56 	392 	JPY 	Иена 	Япония 	
57 	398 	KZT 	Тенге 	Казахстан 	
58 	400 	JOD 	Иорданский динар 	Иордания 	
59 	404 	KES 	Кенийский шиллинг 	Кения 	
60 	408 	KPW 	Северокорейская вона 	Корея, народно-демократическая республика 	
61 	410 	KRW 	Вона 	Корея, республика 	
62 	414 	KWD 	Кувейтский динар 	Кувейт 	
63 	417 	KGS 	Сом 	Киргизия 	
64 	418 	LAK 	Лаосский кип 	Лаосская Народно-Демократическая Республика 	
65 	422 	LBP 	Ливанский фунт 	Ливан 	
66 	426 	LSL 	Лоти 	Лесото 	
67 	430 	LRD 	Либерийский доллар 	Либерия 	
68 	434 	LYD 	Ливийский динар 	Ливия 	
69 	446 	MOP 	Патака 	Макао 	
70 	454 	MWK 	Малавийская квача 	Малави 	
71 	458 	MYR 	Малайзийский ринггит 	Малайзия 	
72 	462 	MVR 	Руфия 	Мальдивы 	
73 	480 	MUR 	Маврикийская рупия 	Маврикий 	
74 	484 	MXN 	Мексиканское песо 	Мексика 	
75 	496 	MNT 	Тугрик 	Монголия 	
76 	498 	MDL 	Молдавский лей 	Молдова, республика 	
77 	504 	MAD 	Марокканский дирхам 	Западная Сахара; Марокко 	
78 	512 	OMR 	Оманский риал 	Оман 	
79 	516 	NAD 	Доллар Намибии 	Намибия 	
80 	524 	NPR 	Непальская рупия 	Непал 	
81 	532 	ANG 	Нидерландский антильский гульден 	Кюрасао; Сен-Мартен (нидерландская часть) 	
82 	533 	AWG 	Арубанский флорин 	Аруба 	
83 	548 	VUV 	Вату 	Вануату 	
84 	554 	NZD 	Новозеландский доллар 	Ниуэ; Новая Зеландия; Острова Кука; Питкерн; Токелау 	
85 	558 	NIO 	Золотая кордоба 	Никарагуа 	
86 	566 	NGN 	Найра 	Нигерия 	
87 	578 	NOK 	Норвежская крона 	Норвегия; Остров Буве; Шпицберген и Ян Майен 	
88 	586 	PKR 	Пакистанская рупия 	Пакистан 	
89 	590 	PAB 	Бальбоа 	Панама 	
90 	598 	PGK 	Кина 	Папуа Новая Гвинея 	
91 	600 	PYG 	Гуарани 	Парагвай 	
92 	604 	PEN 	Соль 	Перу 	Пояснение: изменение наименования действует с 15 декабря 2015 г.
93 	608 	PHP 	Филиппинское песо 	Филиппины 	
94 	634 	QAR 	Катарский риал 	Катар 	
95 	643 	RUB 	Российский рубль 	Россия 	
96 	646 	RWF 	Франк Руанды 	Руанда 	
97 	654 	SHP 	Фунт Святой Елены 	Святая Елена, остров Вознесения, Тристан-да-Кунья 	
98 	682 	SAR 	Саудовский риял 	Саудовская Аравия 	
99 	690 	SCR 	Сейшельская рупия 	Сейшелы 	
100 	694 	SLL 	Леоне 	Сьерра-Леоне 	
101 	702 	SGD 	Сингапурский доллар 	Сингапур 	
102 	704 	VND 	Донг 	Вьетнам 	
103 	706 	SOS 	Сомалийский шиллинг 	Сомали 	
104 	710 	ZAR 	Рэнд 	Лесото; Намибия; Южная Африка 	
105 	728 	SSP 	Южносуданский фунт 	Южный Судан 	данная валюта введена в действие для Южного Судана с 18 июля 2011 г.
106 	748 	SZL 	Лилангени 	Эсватини 	
107 	752 	SEK 	Шведская крона 	Швеция 	
108 	756 	CHF 	Швейцарский франк 	Лихтенштейн; Швейцария 	
109 	760 	SYP 	Сирийский фунт 	Сирийская Арабская Республика 	
110 	764 	THB 	Бат 	Таиланд 	
111 	776 	TOP 	Паанга 	Тонга 	
112 	780 	TTD 	Доллар Тринидада и Тобаго 	Тринидад и Тобаго 	
113 	784 	AED 	Дирхам (ОАЭ) 	Объединенные Арабские Эмираты (ОАЭ) 	
114 	788 	TND 	Тунисский динар 	Тунис 	
115 	800 	UGX 	Угандийский шиллинг 	Уганда 	
116 	807 	MKD 	Денар 	Македония, бывшая Югославская Республика 	
117 	818 	EGP 	Египетский фунт 	Египет 	
118 	826 	GBP 	Фунт стерлингов 	Соединенное королевство 	
119 	834 	TZS 	Танзанийский шиллинг 	Танзания, объединенная республика 	
120 	840 	USD 	Доллар США 	Американское Самоа; Британская территория в Индийском океане; Бонэйр, Синт-Эстатиус и Саба; Виргинские острова (Британские); Виргинские острова (США); Гаити; Гуам; Малые Тихоокеанские Отдаленные острова Соединенных Штатов; Маршалловы Острова; Микронезия, федеративные штаты; Острова Теркс и Кайкос; Палау; Панама; Пуэрто-Рико; Северные Марианские острова; Соединенные Штаты; Тимор-Лесте; Эквадор; Эль-Сальвадор 	данная валюта вводится в действие для Бонэйра, Синт-Эстатиуса и Сабы с 1 января 2011 г.
121 	858 	UYU 	Уругвайское песо 	Уругвай 	
122 	860 	UZS 	Узбекский сум 	Узбекистан 	
123 	882 	WST 	Тала 	Самоа 	
124 	886 	YER 	Йеменский риал 	Йемен 	
125 	901 	TWD 	Новый тайваньский доллар 	Тайвань (Китай) 	
126 	926 	VED 	Боливар Соберано 	Венесуэла (Боливарианская Республика) 	
127 	928 	VES 	Боливар Соберано 	Венесуэла (Боливарианская Республика) 	Пояснение: деноминированная валюта
128 	929 	MRU 	Угия 	Мавритания 	
129 	930 	STN 	Добра 	Сан-Томе и Принсипи 	
130 	931 	CUC 	Конвертируемое песо 	Куба 	данная валюта действует с 1 марта 2009 г.
131 	932 	ZWL 	Доллар Зимбабве 	Зимбабве 	данная валюта введена в действие с 1 февраля 2009 г.
132 	933 	BYN 	Белорусский рубль 	Беларусь 	
133 	934 	TMT 	Новый туркменский манат 	Туркменистан 	
134 	936 	GHS 	Ганский седи 	Гана 	
135 	938 	SDG 	Суданский фунт 	Судан 	
136 	940 	UYI 	Уругвайское песо в индексированных единицах 	Уругвай 	данная валюта действует с 11 ноября 2006 г.
137 	941 	RSD 	Сербский динар 	Сербия 	данная валюта действует с 25 октября 2006 г.
138 	943 	MZN 	Мозамбикский метикал 	Мозамбик 	
139 	944 	AZN 	Азербайджанский манат 	Азербайджан 	данная валюта вводится в действие с 1 января 2006 г.
140 	946 	RON 	Румынский лей 	Румыния 	
141 	949 	TRY 	Турецкая лира 	Турция 	данная валюта введена в действие с 1 января 2009 г.
142 	950 	XAF 	Франк КФА ВЕАС 	Габон; Камерун; Конго; Центрально-Африканская Республика; Чад; Экваториальная Гвинея 	Франк КФА ВЕАС - денежная единица Банка государств Центральной Африки
143 	951 	XCD 	Восточно-карибский доллар 	Ангилья; Антигуа и Барбуда; Гренада; Доминика; Монтсеррат; Сент-Винсент и Гренадины; Сент-Китс и Невис; Сент-Люсия 	
144 	952 	XOF 	Франк КФА ВСЕАО 	Бенин; Буркина-Фасо; Гвинея-Бисау; Кот д'Ивуар; Мали; Нигер; Сенегал; Того 	Франк КФА ВСЕАО - денежная единица Центрального Банка государств Западной Африки
145 	953 	XPF 	Франк КФП 	Новая Каледония; Французская Полинезия; Уоллис и Футуна 	
146 	960 	XDR 	СДР (специальные права заимствования) 	Международный валютный фонд (МВФ) 	
147 	967 	ZMW 	Замбийская квача 	Замбия 	
148 	968 	SRD 	Суринамский доллар 	Суринам 	
149 	969 	MGA 	Малагасийский ариари 	Мадагаскар 	
150 	970 	COU 	Единица реальной стоимости 	Колумбия 	
151 	971 	AFN 	Афгани 	Афганистан 	
152 	972 	TJS 	Сомони 	Таджикистан 	
153 	973 	AOA 	Кванза 	Ангола 	
154 	975 	BGN 	Болгарский лев 	Болгария 	
155 	976 	CDF 	Конголезский франк 	Конго, демократическая республика 	
156 	977 	ВАМ 	Конвертируемая марка 	Босния и Герцеговина 	
157 	978 	EUR 	Евро 	Австрия; Андорра; Бельгия; Гваделупа; Германия; Греция; Ирландия; Испания; Италия; Кипр; Латвия; Литва; Люксембург; Майотта; Мальта; Мартиника; Монако; Нидерланды; Папский Престол (Государство-город Ватикан); Португалия; Реюньон; Сан-Марино; Сен-Бартелеми; Сен-Мартен (французская часть); Сент-Пьер и Микелон; Словакия; Словения; Финляндия; Франция; Французская Гвиана; Французские Южные территории; Черногория; Эландские острова; Эстония 	данная валюта вводится в действие для Латвии с 1 января 2014 г.
158 	980 	UAH 	Гривна 	Украина 	
159 	981 	GEL 	Лари 	Грузия 	
160 	985 	PLN 	Злотый 	Польша 	
161 	986 	BRL 	Бразильский реал 	Бразилия'''.split('\n')
currency = {}
for i in a:
    currency[i.split('\t')[2].strip()] = i.split('\t')[3]
#print([currency[i].strip() for i in currency])
#print([i for i in currency])
#message = 'Болгарский лев'
#print([i for i in currency if currency[i].strip() == message])