week, day = int(input('Неделя ')), int(input('Номер дня '))
table = {1: {1: '1. ИТ | ИБ\n2. ИБ | ИТ\n3. УиФПМ\n4. ИСРПО',
             2: '1. ММ | ИСРПО\n2. ИБ | ОПБД\n3. ИБ\n',
             3: '1. УиФПМ | ММ\n2. ОПБД | УиФПМ\n',
             4: '1. ОПБД | УиФПМ\n2. ФК\n3. ИЯВПД\n4. ДМ',
             5: '1. ----\n2. КЧ\n3. ОПБД\n4. ЭП',
             6: '1. ИТ\n2. ТВ\n'},
         2: {1: '1. ИТ | --\n2. УиФПМ | ИТ\n3. ИБ',
             2: '1. ----\n2. ИСРПО | УиФПМ\n3. УиФПМ\n4. -- | ОПБД',
             3: '1. ФК\n2. ИСРПО\n3. ММ\n4. ДМ',
             4: '1. КЧ\n2. ИТ\n3. УиФПМ | ИБ\n',
             5: '1. ТМ\n2. ЭП\n3. ИЯВПД\n',
             6: '1. ОПБД\n2. ИБ\n'}}
print(table[week][day])